# Изменение регистра в строке с помощью методов

name = "ada lovelace"
print(name.title()) # Метод title()выполняет капитализацию начальных букв каждого слова (переводит их в верхний регистр)
print()

# Для работы с регистром существуют и другие полезные методы. 
# Так, все символы строки можно преобразовать в верхний или нижний регистр:

# Метод lower() особенно полезен для хранения данных.

name = "Ada Lovelace"
print(name.upper()) # Все приводим к верхнему регистру
print(name.lower()) # Все приводим к нижнему регистру


# Использование переменных в строках

