print()
print("""Вещественные числа
      
      В Python числа, имеющие дробную часть, называются вещественными (или чис-
лами с плавающей точкой).
      
      В большинстве случаев вы можете использовать вещественные числа, не особенно
задумываясь об их поведении. Просто введите нужные числа, а Python, скорее всего,
сделает именно то, что вы от него хотите:
""")
a = 0.1 + 0.1
print("a = 0.1 + 0.1 \n\ta =", a)

b = 0.2 + 0.2
print("b = 0.2 + 0.2 \n\tb =", b)

c = 2 * 0.1
print("c = 2 * 0.1 \n\tc =", c)

d = 2 * 0.2
print("d = 2 * 0.2 \n\td =", d)
print()